[
{"Link": "https://www.amazon.com/product-reviews/B07N7PK9QK/sortBy=recent/sortBy=recent/ref=cm_cr_arp_d_paging_btm_next_2?sortBy=recent&pageNumber=2"},
{"asin": "B07N7PK9QK", "text": "one time I accidentally try to shape myself up and mess it up bad and let me tell you the Mielle helped it grow back so fast. It took about 2-3 weeks just for it to come back. It's really good for damaged hair, it's easy to apply to hair! Also, it's good if you have a lot of breakage!!! DEFINITELY RECOMMEND! 100/10", "title": "HAIR GROWTH", "location_and_date": "Reviewed in the United States on February 2, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I have been using this hair oil for about a month. I have noticed a little hair growth. I use about 3 times a week and massage into my hair/scalp. I will be repurchasing to see continued growth! The product last for a long time!", "title": "good results in about one month", "location_and_date": "Reviewed in the United States on February 1, 2024", "verified": true, "rating": "4.0"},
{"asin": "B07N7PK9QK", "text": "Is is luxury product ... nahIs this necessity ... obviously!!!!!", "title": "Must buy product", "location_and_date": "Reviewed in the United States on February 1, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Love it!", "title": "New Favorite to Hair Routine!", "location_and_date": "Reviewed in the United States on February 1, 2024", "verified": false, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I bought this oil because my edges are gone baby. With all of the hype over this oil, I tried it. It’s been a month and bay, this thing did nothing! I use it morning and night; I don’t wash it out. And to see if it’s effective, I intentionally use it without pairing it with another thing. Unfortunately, this small bottle is not worth the hype for me and my edges do not like it. Oh, and it makes my edges feel peazy after massage it into my hair for 3-5mins. No bueno but it smells good.", "title": "A little Disappointed", "location_and_date": "Reviewed in the United States on February 1, 2024", "verified": true, "rating": "2.0"},
{"asin": "B07N7PK9QK", "text": "I use this oil multiple times a week! I love it!", "title": "Love this oil", "location_and_date": "Reviewed in the United States on February 1, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I did not believe when I saw some reviews saying that they starting seeing results since the first use but now I believe because it happened to me. I have natural black straight hair and it was gettin ashy the ends splitting and the frizz really tangled it. since the first use I notice an improvement in the color and after a few weeks my hair is shiny and super dark like it used to be. I am very glad with y purchase. If I had to picky I would have to say that the odor was not it. 4/5 on that.", "title": "The real deal", "location_and_date": "Reviewed in the United States on February 1, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "To really get a good application you’re supposed to massage it at the root of your hair into your scalp. However, it makes my hair greasy AF and dirty looking. So I’d probably recommend doing it before bed and then washing your hair in the morning. But I’ve definitely noticed growth in a short timeframe so I’d for sure recommend!!", "title": "Pros and cons but it works!", "location_and_date": "Reviewed in the United States on February 1, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": ".my hair is softer and fuller.", "title": "Rosemary oil", "location_and_date": "Reviewed in the United States on February 1, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Makes my dry thin hair fill soft. Helping with split ends", "title": "Shiny hair", "location_and_date": "Reviewed in the United States on February 1, 2024", "verified": true, "rating": "4.0"},
{"Link": "https://www.amazon.com/product-reviews/B07N7PK9QK/sortBy=recent/sortBy=recent/ref=cm_cr_arp_d_paging_btm_next_3?sortBy=recent&pageNumber=3"},
{"asin": "B07N7PK9QK", "text": "I've been using once or twice a week for the last 2 months.  I can say I have less hair to clean out from my brush since Ive started using this!", "title": "I like it!", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Sufro mucho de caída y más que todo en las entradas y esto me a salvado, es increíble", "title": "Para la caída e hidratación es muy bueno", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "My hair has stopped falling out so much and I've used this for about 4 weeks. My hair looks and feels healthy", "title": "This has done so much for my hair", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I just went through my last bottle. I didn't see any difference in my hair growth, I still have the same amount of hair fall. I used to put it on my scalp, but it only made it oily, so I started using it on the ends of my hair instead, making it soft.The rosemary mint scent is strong, but I didn't mind it.", "title": "It didn't work the way I expected it to", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "3.0"},
{"asin": "B07N7PK9QK", "text": "I started using this for my thinning hair and I noticed a huge difference in only a week. I use a tiny bit like instructed. It did start giving me headaches, but I apply it now and leave on for a couple hours then wash my hair.", "title": "Grew my hair in only a week of using it", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Good choice", "title": "I like", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Have no idea why Amazon rejected my first review on this item, but I liked the product and will repurchase.", "title": "Liked it", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "El envase no sirve que romper con facilidad he comprado tres y se rompe en uno abriéndolo. Pero el producto es muy bueno y funciona.", "title": "El producto es bueno y funciona", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "4.0"},
{"asin": "B07N7PK9QK", "text": "works as advertised- baby hairs appeared on my hairline after 4 uses. 10/10 recommended !", "title": "works as advertised", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "This hair oils amazing I’ve noticed strong hair growth and less hair falling out since using about 6 months ago. I don’t love there leave in but just purchased a hair mask and I’m excited.", "title": "Great product", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"Link": "https://www.amazon.com/product-reviews/B07N7PK9QK/sortBy=recent/sortBy=recent/ref=cm_cr_arp_d_paging_btm_next_4?sortBy=recent&pageNumber=4"},
{"asin": "B07N7PK9QK", "text": "I've heard so many good things about this production had to try it myself. Before I get in the shower I put this on my hair before I shower and after it is feeling supper smooth and so Shiney", "title": "Soft", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Lo amo! Hay productos que se vuelven tendencia pero no cumplen lo que prometen, pero este wow, me encanta y desde que lo uso siento la diferencia en cuanto a la salida del pelo. Lo recomiendo, es pequeño pero vale la pena. Lo uso 2 veces por semana por algunas 2 horas.", "title": "Excelente", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Seen this on tik tok and decided to give it a try, so thankful I did!! I massage in my scalp and brush through as directions state, smell is light and not overwhelming. I along with my children have already noticed the thickness & length growing in just a week!!! This stuff really works. Trust me I never leave reviews and this deserved one.", "title": "Results in just a WEEK!!!!", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I use this along with my Wild Growth Oil. It is a game changer.", "title": "Great", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Giving it 5 stars so my review doesn't get lost. This caused my hair to fall out, I have severe shedding. I regret using this in my hair. I have 4c hair, my hair was already long, but I thought why no go for longer. So I bought this after reading all the excellent reviews. Congrats to all those who saw success, but I'm just letting you all know your hair might fall out like mine. In the process of returning it.", "title": "Caused EXCESSIVE hair loss", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Bought this to put in my hair to help growth, I feel like it did help grow a little. However, I would massage it in my hair and it would help the top of my head not feel itchy from being in a pony tail/bun", "title": "Love", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "it doesn't really work for dry hair. my wife did not get any result that is in the description. she is very upset.", "title": "Not good", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "3.0"},
{"asin": "B07N7PK9QK", "text": "Mielle Organics Rosemary Mint Scalp & Hair Strengthening Oil is a game-changer for anyone seeking healthier, shinier, and stronger hair. Packed with nutrient-rich, biotin-infused ingredients, this treatment nourishes and strengthens hair from root to tip, leaving behind a refreshing, invigorating scent.One of its standout features is its ability to smooth split ends, providing a sleek and polished look. Additionally, it soothes dry scalp and combats dandruff, thanks to its rich blend of over 30 essential oils and nutrients.What sets this product apart is its versatility—it's suitable for all hair types, including chemically-treated, braided, and weaved hair.As a woman who values natural beauty and effective results, I am impressed by Mielle Organics' commitment to using gentle, organic ingredients. Overall, this product has become an essential part of my hair care routine, leaving me with luscious, radiant hair that I love.", "title": "Good stuff", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "To me, this oil feels kind of slimy (which isn't a bad thing in my opinion), but I feel it works great. I'm not sure if it promotes growth but it definitely helps my hair feel more hydrated! Has a minty scent. I would highly recommend!", "title": "Great", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I was losing clumps of hair so randomly back in October or November. So i started using this oil every other day for about a month now and I'm seeing a LOT OF IMPROVEMENT with my hair fall. It has greatly reduced my hair fall, it went from 100+ strands to ~25 strands in the shower. I found that if you deep oil and wear a satin or silk cap and then sleep overnight with it then you lose less than 10 strands. But consistency is key. The quality of my hair is getting better too. I see very few baby hairs growing at the moment, i think I'll have more after 2 to 3 months. My hair length hasn't really changed much tho. But I'm liking it so far.", "title": "It helped me a lot", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "4.0"},
{"Link": "https://www.amazon.com/product-reviews/B07N7PK9QK/sortBy=recent/sortBy=recent/ref=cm_cr_arp_d_paging_btm_next_5?sortBy=recent&pageNumber=5"},
{"asin": "B07N7PK9QK", "text": "This works so well on my hair and smells great. I use it on my scalp and at my ends and my hairdresser complemented my hair growth during my last visit!", "title": "Great product", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I use this product for about 3 1/2 weeks and my hair was falling out in literal chunks anytime I touched it, washed it or combed through it. I have 3B hair. I only applied it 3 times after washing and air drying my hair…", "title": "Hair fell out", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "2.0"},
{"asin": "B07N7PK9QK", "text": "Work ok but not as well as I had hoped it would", "title": "Leaves scalp a little better, I may need a prescription  product  for my dry itching", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "4.0"},
{"asin": "B07N7PK9QK", "text": "My hair has never looked better seriously!!", "title": "Buy!!!", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Seems to be working well, smells nice in my opinion.", "title": "Works well", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "So far so good. Just ordered my third bottle too soon to say if it’s helped hair growth and that’s the only reason for three stars. Will review again when I have time to see if it works", "title": "Just ordered my third bottle", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "3.0"},
{"asin": "B07N7PK9QK", "text": "I have been using this for a month or so now and i love it. I use it daily on my ends and oil my scalp every week and leave it in for a few hrs and rinse it out. It’s made my hair so soft and more fluffy. I have natural straight and thin hair so this really changed my hair for the better.", "title": "Best hair oil", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Dislike the smell", "title": "Dislike smell", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "4.0"},
{"asin": "B07N7PK9QK", "text": "I bought both shampoo and conditioner, after 2 weeks my hair kept falling.deceived by good reviews, and now i came back to use my original expensive shampoo.", "title": "cheap product make my hair falling", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "1.0"},
{"asin": "B07N7PK9QK", "text": "I used this product for dry scalp and hair. Did a test spot no problem. Then used it  the way the directions said. It was when I went to wash it out my head started burning so bad. It still burns. 🥵.", "title": "My scalp is still burning", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "1.0"},
{"Link": "https://www.amazon.com/product-reviews/B07N7PK9QK/sortBy=recent/sortBy=recent/ref=cm_cr_arp_d_paging_btm_next_6?sortBy=recent&pageNumber=6"},
{"asin": "B07N7PK9QK", "text": "I bought this product to help with genetic hair loss. I have only been using it for 2 weeks, and I believe I'm noticing the baby hairs at the top of my head are a bit longer and more pronounced now. Other than that, it's a little hard for me to tell if my bald spots (mostly at my parietal ridge) are really growing back in. However, this oil has provided another benefit I didn't expect: it's restored my natural curl pattern. I oil my hair, massage it in, and let it \"marinate\" for a couple hours every wash day (every 2/3 days), and I've noticed my hair air dries SO wavy now, with almost no tangles. As someone who has struggled to preserve and take care of my wavy hair, this was a lifesaver. My hair looks properly curly and voluminous now (as opposed to stringy and frizzy before), such that my bald spots are MUCH less noticeable. Additionally, the coarseness of my hair has improved a LOT - my hair hasn't been so soft and shiny since I was a kid. Regardless of whether it causes regrowth, this oil has improved my hair's appearance and texture so much that it was 100% worth the buy.", "title": "Restored curl pattern, softened hair", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "But I'm sticking with it.", "title": "Itches my scalp", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "4.0"},
{"asin": "B07N7PK9QK", "text": "Muy bueno calidad precio", "title": "Muy bueno calidad precio", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I have been you this product for some time now it didn't make my hair grow or make it soft.what it did do to my hair was to dry it out to a point where it has broken off completely. My hair is worse than when I started using this product.If you want to keep your hair do use this product.", "title": "Drying Hair", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": false, "rating": "1.0"},
{"asin": "B07N7PK9QK", "text": "Me encanta después de mi parto lo estuve utilizando para que mi pelo no se me salga y de verdad me ayuda mucho", "title": "El mejor", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Great quality, great price, item as discribed.", "title": "Great item", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Buen producto", "title": "Bueno", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Estaba buscando algo que me ayudara a no perder tanto cabello , se me caia muchismo y encontre este producto gracias a dios super bueno de la primera aplicacion note q cuando me peinaba mi cabello dejo de caer. Lo recomiendo muy bueno", "title": "Super 💯", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I started using this oil a month ago and already notice healthier and shinier hair. I use it about 2x a week and allow it to sit in my hair for a few hours before washing it out. The scent is nice and it is lightweight", "title": "Helpful Oil", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "4.0"},
{"asin": "B07N7PK9QK", "text": "My dad starting losing his hair long before I was born, so hair loss has always been a fear. Not only does this help with the light problems now, but the smell is so strong I feel confident about myself.", "title": "Makes me feel confident", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"}
]