[
{"Link": "https://www.amazon.com/product-reviews/B07N7PK9QK/sortBy=recent/sortBy=recent/ref=cm_cr_arp_d_paging_btm_next_2?sortBy=recent&pageNumber=2"},
{"asin": "B07N7PK9QK", "text": "Is is luxury product ... nahIs this necessity ... obviously!!!!!", "title": "Must buy product", "location_and_date": "Reviewed in the United States on February 1, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Love it!", "title": "New Favorite to Hair Routine!", "location_and_date": "Reviewed in the United States on February 1, 2024", "verified": false, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I bought this oil because my edges are gone baby. With all of the hype over this oil, I tried it. It’s been a month and bay, this thing did nothing! I use it morning and night; I don’t wash it out. And to see if it’s effective, I intentionally use it without pairing it with another thing. Unfortunately, this small bottle is not worth the hype for me and my edges do not like it. Oh, and it makes my edges feel peazy after massage it into my hair for 3-5mins. No bueno but it smells good.", "title": "A little Disappointed", "location_and_date": "Reviewed in the United States on February 1, 2024", "verified": true, "rating": "2.0"},
{"asin": "B07N7PK9QK", "text": "I use this oil multiple times a week! I love it!", "title": "Love this oil", "location_and_date": "Reviewed in the United States on February 1, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I did not believe when I saw some reviews saying that they starting seeing results since the first use but now I believe because it happened to me. I have natural black straight hair and it was gettin ashy the ends splitting and the frizz really tangled it. since the first use I notice an improvement in the color and after a few weeks my hair is shiny and super dark like it used to be. I am very glad with y purchase. If I had to picky I would have to say that the odor was not it. 4/5 on that.", "title": "The real deal", "location_and_date": "Reviewed in the United States on February 1, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "To really get a good application you’re supposed to massage it at the root of your hair into your scalp. However, it makes my hair greasy AF and dirty looking. So I’d probably recommend doing it before bed and then washing your hair in the morning. But I’ve definitely noticed growth in a short timeframe so I’d for sure recommend!!", "title": "Pros and cons but it works!", "location_and_date": "Reviewed in the United States on February 1, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": ".my hair is softer and fuller.", "title": "Rosemary oil", "location_and_date": "Reviewed in the United States on February 1, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Makes my dry thin hair fill soft. Helping with split ends", "title": "Shiny hair", "location_and_date": "Reviewed in the United States on February 1, 2024", "verified": true, "rating": "4.0"},
{"asin": "B07N7PK9QK", "text": "I've been using once or twice a week for the last 2 months.  I can say I have less hair to clean out from my brush since Ive started using this!", "title": "I like it!", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Sufro mucho de caída y más que todo en las entradas y esto me a salvado, es increíble", "title": "Para la caída e hidratación es muy bueno", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"Link": "https://www.amazon.com/product-reviews/B07N7PK9QK/sortBy=recent/sortBy=recent/ref=cm_cr_arp_d_paging_btm_next_3?sortBy=recent&pageNumber=3"},
{"asin": "B07N7PK9QK", "text": "My hair has stopped falling out so much and I've used this for about 4 weeks. My hair looks and feels healthy", "title": "This has done so much for my hair", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I just went through my last bottle. I didn't see any difference in my hair growth, I still have the same amount of hair fall. I used to put it on my scalp, but it only made it oily, so I started using it on the ends of my hair instead, making it soft.The rosemary mint scent is strong, but I didn't mind it.", "title": "It didn't work the way I expected it to", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "3.0"},
{"asin": "B07N7PK9QK", "text": "I started using this for my thinning hair and I noticed a huge difference in only a week. I use a tiny bit like instructed. It did start giving me headaches, but I apply it now and leave on for a couple hours then wash my hair.", "title": "Grew my hair in only a week of using it", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Good choice", "title": "I like", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Have no idea why Amazon rejected my first review on this item, but I liked the product and will repurchase.", "title": "Liked it", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "El envase no sirve que romper con facilidad he comprado tres y se rompe en uno abriéndolo. Pero el producto es muy bueno y funciona.", "title": "El producto es bueno y funciona", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "4.0"},
{"asin": "B07N7PK9QK", "text": "works as advertised- baby hairs appeared on my hairline after 4 uses. 10/10 recommended !", "title": "works as advertised", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "This hair oils amazing I’ve noticed strong hair growth and less hair falling out since using about 6 months ago. I don’t love there leave in but just purchased a hair mask and I’m excited.", "title": "Great product", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I've heard so many good things about this production had to try it myself. Before I get in the shower I put this on my hair before I shower and after it is feeling supper smooth and so Shiney", "title": "Soft", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Lo amo! Hay productos que se vuelven tendencia pero no cumplen lo que prometen, pero este wow, me encanta y desde que lo uso siento la diferencia en cuanto a la salida del pelo. Lo recomiendo, es pequeño pero vale la pena. Lo uso 2 veces por semana por algunas 2 horas.", "title": "Excelente", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"Link": "https://www.amazon.com/product-reviews/B07N7PK9QK/sortBy=recent/sortBy=recent/ref=cm_cr_arp_d_paging_btm_next_4?sortBy=recent&pageNumber=4"},
{"asin": "B07N7PK9QK", "text": "Seen this on tik tok and decided to give it a try, so thankful I did!! I massage in my scalp and brush through as directions state, smell is light and not overwhelming. I along with my children have already noticed the thickness & length growing in just a week!!! This stuff really works. Trust me I never leave reviews and this deserved one.", "title": "Results in just a WEEK!!!!", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I use this along with my Wild Growth Oil. It is a game changer.", "title": "Great", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Giving it 5 stars so my review doesn't get lost. This caused my hair to fall out, I have severe shedding. I regret using this in my hair. I have 4c hair, my hair was already long, but I thought why no go for longer. So I bought this after reading all the excellent reviews. Congrats to all those who saw success, but I'm just letting you all know your hair might fall out like mine. In the process of returning it.", "title": "Caused EXCESSIVE hair loss", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Bought this to put in my hair to help growth, I feel like it did help grow a little. However, I would massage it in my hair and it would help the top of my head not feel itchy from being in a pony tail/bun", "title": "Love", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "it doesn't really work for dry hair. my wife did not get any result that is in the description. she is very upset.", "title": "Not good", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "3.0"},
{"asin": "B07N7PK9QK", "text": "Mielle Organics Rosemary Mint Scalp & Hair Strengthening Oil is a game-changer for anyone seeking healthier, shinier, and stronger hair. Packed with nutrient-rich, biotin-infused ingredients, this treatment nourishes and strengthens hair from root to tip, leaving behind a refreshing, invigorating scent.One of its standout features is its ability to smooth split ends, providing a sleek and polished look. Additionally, it soothes dry scalp and combats dandruff, thanks to its rich blend of over 30 essential oils and nutrients.What sets this product apart is its versatility—it's suitable for all hair types, including chemically-treated, braided, and weaved hair.As a woman who values natural beauty and effective results, I am impressed by Mielle Organics' commitment to using gentle, organic ingredients. Overall, this product has become an essential part of my hair care routine, leaving me with luscious, radiant hair that I love.", "title": "Good stuff", "location_and_date": "Reviewed in the United States on January 31, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "To me, this oil feels kind of slimy (which isn't a bad thing in my opinion), but I feel it works great. I'm not sure if it promotes growth but it definitely helps my hair feel more hydrated! Has a minty scent. I would highly recommend!", "title": "Great", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I was losing clumps of hair so randomly back in October or November. So i started using this oil every other day for about a month now and I'm seeing a LOT OF IMPROVEMENT with my hair fall. It has greatly reduced my hair fall, it went from 100+ strands to ~25 strands in the shower. I found that if you deep oil and wear a satin or silk cap and then sleep overnight with it then you lose less than 10 strands. But consistency is key. The quality of my hair is getting better too. I see very few baby hairs growing at the moment, i think I'll have more after 2 to 3 months. My hair length hasn't really changed much tho. But I'm liking it so far.", "title": "It helped me a lot", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "4.0"},
{"asin": "B07N7PK9QK", "text": "This works so well on my hair and smells great. I use it on my scalp and at my ends and my hairdresser complemented my hair growth during my last visit!", "title": "Great product", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I use this product for about 3 1/2 weeks and my hair was falling out in literal chunks anytime I touched it, washed it or combed through it. I have 3B hair. I only applied it 3 times after washing and air drying my hair…", "title": "Hair fell out", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "2.0"},
{"Link": "https://www.amazon.com/product-reviews/B07N7PK9QK/sortBy=recent/sortBy=recent/ref=cm_cr_arp_d_paging_btm_next_5?sortBy=recent&pageNumber=5"},
{"asin": "B07N7PK9QK", "text": "Work ok but not as well as I had hoped it would", "title": "Leaves scalp a little better, I may need a prescription  product  for my dry itching", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "4.0"},
{"asin": "B07N7PK9QK", "text": "My hair has never looked better seriously!!", "title": "Buy!!!", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Seems to be working well, smells nice in my opinion.", "title": "Works well", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "So far so good. Just ordered my third bottle too soon to say if it’s helped hair growth and that’s the only reason for three stars. Will review again when I have time to see if it works", "title": "Just ordered my third bottle", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "3.0"},
{"asin": "B07N7PK9QK", "text": "I have been using this for a month or so now and i love it. I use it daily on my ends and oil my scalp every week and leave it in for a few hrs and rinse it out. It’s made my hair so soft and more fluffy. I have natural straight and thin hair so this really changed my hair for the better.", "title": "Best hair oil", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Dislike the smell", "title": "Dislike smell", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "4.0"},
{"asin": "B07N7PK9QK", "text": "I bought both shampoo and conditioner, after 2 weeks my hair kept falling.deceived by good reviews, and now i came back to use my original expensive shampoo.", "title": "cheap product make my hair falling", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "1.0"},
{"asin": "B07N7PK9QK", "text": "I used this product for dry scalp and hair. Did a test spot no problem. Then used it  the way the directions said. It was when I went to wash it out my head started burning so bad. It still burns. 🥵.", "title": "My scalp is still burning", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "1.0"},
{"asin": "B07N7PK9QK", "text": "I bought this product to help with genetic hair loss. I have only been using it for 2 weeks, and I believe I'm noticing the baby hairs at the top of my head are a bit longer and more pronounced now. Other than that, it's a little hard for me to tell if my bald spots (mostly at my parietal ridge) are really growing back in. However, this oil has provided another benefit I didn't expect: it's restored my natural curl pattern. I oil my hair, massage it in, and let it \"marinate\" for a couple hours every wash day (every 2/3 days), and I've noticed my hair air dries SO wavy now, with almost no tangles. As someone who has struggled to preserve and take care of my wavy hair, this was a lifesaver. My hair looks properly curly and voluminous now (as opposed to stringy and frizzy before), such that my bald spots are MUCH less noticeable. Additionally, the coarseness of my hair has improved a LOT - my hair hasn't been so soft and shiny since I was a kid. Regardless of whether it causes regrowth, this oil has improved my hair's appearance and texture so much that it was 100% worth the buy.", "title": "Restored curl pattern, softened hair", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "But I'm sticking with it.", "title": "Itches my scalp", "location_and_date": "Reviewed in the United States on January 30, 2024", "verified": true, "rating": "4.0"},
{"Link": "https://www.amazon.com/product-reviews/B07N7PK9QK/sortBy=recent/sortBy=recent/ref=cm_cr_arp_d_paging_btm_next_6?sortBy=recent&pageNumber=6"},
{"asin": "B07N7PK9QK", "text": "Muy bueno calidad precio", "title": "Muy bueno calidad precio", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I have been you this product for some time now it didn't make my hair grow or make it soft.what it did do to my hair was to dry it out to a point where it has broken off completely. My hair is worse than when I started using this product.If you want to keep your hair do use this product.", "title": "Drying Hair", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": false, "rating": "1.0"},
{"asin": "B07N7PK9QK", "text": "Me encanta después de mi parto lo estuve utilizando para que mi pelo no se me salga y de verdad me ayuda mucho", "title": "El mejor", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Great quality, great price, item as discribed.", "title": "Great item", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Buen producto", "title": "Bueno", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Estaba buscando algo que me ayudara a no perder tanto cabello , se me caia muchismo y encontre este producto gracias a dios super bueno de la primera aplicacion note q cuando me peinaba mi cabello dejo de caer. Lo recomiendo muy bueno", "title": "Super 💯", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I started using this oil a month ago and already notice healthier and shinier hair. I use it about 2x a week and allow it to sit in my hair for a few hours before washing it out. The scent is nice and it is lightweight", "title": "Helpful Oil", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "4.0"},
{"asin": "B07N7PK9QK", "text": "My dad starting losing his hair long before I was born, so hair loss has always been a fear. Not only does this help with the light problems now, but the smell is so strong I feel confident about myself.", "title": "Makes me feel confident", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "After reading all the great reviews, I decided to try the product. Unfortunately my hair began to thin and fell out in certain areas. My daughter uses this product so I gave it to her. I created my own hair oil and my hair has thickened up and the bald spots are filling back in.", "title": "Not for me", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "2.0"},
{"asin": "B07N7PK9QK", "text": "I like the feel of it, applying to hair. Doesn't have that goopy texture that a lot of traditional hair oils, especially ones with coconut oil has. Easy to wash out with normal shampoo too. Left my fine, straight hair feeling soft from treatment rather than greasy and weighed down from too much product. Overall, 2 weeks in, not bad! We'll see if continued use brings more benefits.", "title": "Moisture without grease", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"},
{"Link": "https://www.amazon.com/product-reviews/B07N7PK9QK/sortBy=recent/sortBy=recent/ref=cm_cr_arp_d_paging_btm_next_7?sortBy=recent&pageNumber=7"},
{"asin": "B07N7PK9QK", "text": "This is the Holy grail!!!!Best hair product ever made!!!", "title": "Hair treatment", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "If you know you know. 5 stars", "title": "Love it", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "My wife loves this products as it does the job. Only problem is I dont like the smell.", "title": "Does the job.", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "4.0"},
{"asin": "B07N7PK9QK", "text": "Wish there was a bigger bottle. I love it.", "title": "Third time buying this", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "After returning from a long international trip, I was experiencing hair fall, which I attributed to changes in water, food, etc. While giving myself some time to readjust, I came across the Mielle rosemary mint scalp and hair strengthening oil listed by amazon among the bestsellers in Beauty and Personal care category. At first glance, the name did not interest me because I already have a few essential oils for hair care. However, the enticing price ~$8 tempted me to make the purchase, and I thought I wouldn't lose much in case it didn't help me.The very first time, I massaged 8-10 drops of the oil in the evening and let it stay overnight (rosemary oil may delay sleep in some individuals). The next morning, I noticed that the hair fall had reduced drastically after just one use. Probably, the oil treatment instantly strengthens the roots.The cause of hair fall varies from individual to individual, so does the remedy. Depending on your needs, start with a few drops of the oil and proceed with overnight treatment only if you are comfortable. I hope the oil works for you the way it did for me, and I will update my progress after a few months.The product is sold in a dark-colored glass dropper bottle and does not come with a tamper-proof seal. Since it is recommended for daily use, a push pump bottle should also be an option for customers who prefer it. This may protect the essential oils and other ingredients from degradation caused by daily exposure to light and air.Important: I paid for the purchase.", "title": "Is it justified to be placed among the bestsellers?", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I definitely noticed my hair got longer. My hair started to get more healthy and long it works really well. I think there are better options to treat your hair with but this is still an amazing product. 10/10", "title": "Love", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "4.0"},
{"asin": "B07N7PK9QK", "text": "My scalp started itchy like crazy after two uses of this stuff. I also developed a bunch of little white head clusters all around my hairline which indicate some type of allergic reaction. I looked deeper into my scalp and the same little clusters of white heads were EVERYWHERE!! My scalp is soooo sore now and looks nasty. Have to wear a hat this week. Be careful of this product", "title": "Itchy Scalp and clusters of pimples", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "1.0"},
{"asin": "B07N7PK9QK", "text": "Amo este aceite para el pelo deben tratarlo😍", "title": "Amazing", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I love how it feels in your hair would definitely recommend to all my friends! 💚", "title": "Tingling sensation nice scent", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "My hair has really thinned out from bleaching and stress. I’ve started using this and my hair feel so moisturized. I didn’t realize how dried out it was until I let this sit in my hair for a few hours and washed it out. Sometimes I’ll keep it in overnight and it feels amazing afterwards. I do recommend if your hair is really dried out from bleaching.", "title": "Good for damaged bleached dried hair", "location_and_date": "Reviewed in the United States on January 29, 2024", "verified": true, "rating": "5.0"},
{"Link": "https://www.amazon.com/product-reviews/B07N7PK9QK/sortBy=recent/sortBy=recent/ref=cm_cr_arp_d_paging_btm_next_8?sortBy=recent&pageNumber=8"},
{"asin": "B07N7PK9QK", "text": "I love this product and constantly re-buy it when I run out! it works better than any other hair growth serum I have tried. The smell is a little strong for my liking, but if you like the smell of rosemary then you'll love it. I recommend using a scalp brush to rub it in after applying it and then letting it sit for a few hours before showering.", "title": "My go to hair growth product", "location_and_date": "Reviewed in the United States on January 28, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Like the way it smells let’s hope it work for me too soon to give my honest opinion", "title": "Smells fantastic", "location_and_date": "Reviewed in the United States on January 28, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "This hair streghtening oil is one I’ve gotten a lot of my friends on! It’s so cheap & works great. The dropper works well & the oil smells nice and minty. I’ve mainly purchased it to use on a spot where I have less hair than elsewhere but it worked so well I ended up using it on my entire scalp and even on my ends. Couldn’t recommend this more!", "title": "So good & so cheap", "location_and_date": "Reviewed in the United States on January 28, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Relieves itching and dry scalp. Smells great!", "title": "Simply wonderful", "location_and_date": "Reviewed in the United States on January 28, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I bought it for rosemary. There is little to no rosemary. Number 1 ingredient is soybean oil. That's how it should be advertised. Will try and send back.", "title": "#1 ingredient is soybean oil", "location_and_date": "Reviewed in the United States on January 28, 2024", "verified": true, "rating": "1.0"},
{"asin": "B07N7PK9QK", "text": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n     I have grown lots of baby hairsI use it twice a week and scalp massage gently for 10 minutes", "title": "Love it", "location_and_date": "Reviewed in the United States on January 27, 2024", "verified": false, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I bought this in hopes it would help my hair from getting dried out. Have never used stuff like this before and what I learned the hard way is a little goes a long way. Just a little in your hand then rub your hands together and then place on wet or damp hair and it works ok. Not a growing your hair thing either.", "title": "a little", "location_and_date": "Reviewed in the United States on January 27, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Love this product 😍", "title": "PERFECT", "location_and_date": "Reviewed in the United States on January 27, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I have been using this for a year now and just purchased my third bottle. I have textured curly hair and this has helped SO MUCH with putting moisture back into my hair and scalp. I go about 4-6 days between washes and on the last day I put this all over my scalp and root of hair and rub it in. I then let it sit for as long as I can before washing out. Another way I use it is for refreshing my curls. I added the oil into a spray bottle with HOT water and shake it up. I spray all over my dry hair to refresh my curls after sleeping on them or having hair in a braid/pony tail. OVERALL amazing product and super cheap. I have referred it to many friends and family.", "title": "Amazing Hair Mask!!", "location_and_date": "Reviewed in the United States on January 27, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I get very dry and flaky scalp especially in the winter and my hair has been very dry as well. I read that rosemary oil can help dry and itchy scalp. I was worried putting and oil on my scalp would cause it to be oily but it hasn’t at all. I wash my hair about 3 times a week, and after I wash it while it’s still slightly damp I massage 4 drops into my scalp and 4 drops through the ends. It only took a few times for me to notice a difference. My scalp is no longer dry and itchy, it feels relieved, and no more flakes. Also the ends of my hair are much softer. I find my hair isn’t getting greasy as fast probably because my scalp isn’t dry so it’s not over producing oil anymore. This oil has a nice smell too it too. I’d give it a try, it’s affordable and the bottle is going to last me a while.", "title": "Helped with flaky dry scalp", "location_and_date": "Reviewed in the United States on January 27, 2024", "verified": true, "rating": "5.0"},
{"Link": "https://www.amazon.com/product-reviews/B07N7PK9QK/sortBy=recent/sortBy=recent/ref=cm_cr_arp_d_paging_btm_next_9?sortBy=recent&pageNumber=9"},
{"asin": "B07N7PK9QK", "text": "Very nice product, good price, and effective. I have a dry scalp and my skin gets very flaky, and putting on this oil for an hour or two before washing my hair has been really helpful to my scalp.", "title": "Helps my dry scalp", "location_and_date": "Reviewed in the United States on January 27, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I love this oil. I saw so many negative things online about women with straight or thin hair using this but it has truly helped my post partum hair loss and thickened my hair so much. I use 1x/ week and massage with a scalp massager, leave for a few hours or overnight then shower", "title": "Helped with post partum hair loss", "location_and_date": "Reviewed in the United States on January 27, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "The media could not be loaded.", "title": "Great oil not so great packaging", "location_and_date": "Reviewed in the United States on January 27, 2024", "verified": true, "rating": "4.0"},
{"asin": "B07N7PK9QK", "text": "I’m not sure if it’s helping my hair grow in yet but it is sticky and therefore difficult to apply and spread and massage. Makes it noticeable too. Not a fan. I liked another brand much better.", "title": "Sticky", "location_and_date": "Reviewed in the United States on January 27, 2024", "verified": true, "rating": "2.0"},
{"asin": "B07N7PK9QK", "text": "I learned that even without squeezing the dropper the product leaks fast. It will also burn your eyes. I do love the smell. It’s a strong mint aromatherapy smell. It also, helped my eye brows grow faster. I only add a drop to my hair because it’s so greasy", "title": "Product comes out quickly", "location_and_date": "Reviewed in the United States on January 27, 2024", "verified": true, "rating": "4.0"},
{"asin": "B07N7PK9QK", "text": "I love this oil and the shampoo too. I bought them both and couldn’t be happier with how my hair looks and feels . I will continue to buy and highly recommend", "title": "Great product", "location_and_date": "Reviewed in the United States on January 27, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Llevo alrededor de 2 semanas usándolo hay que esperar un poco para ver los resultados pero hasta ahora todo bien", "title": "Calidad", "location_and_date": "Reviewed in the United States on January 27, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Es un excelente aceite para el crecimiento del cabello ya lo he comprado varias veces y me ayuda muchísimo a crecer el cabello", "title": "El mejor aceite", "location_and_date": "Reviewed in the United States on January 27, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I initially bought a bottle of this on impulse while waiting in line at Ulta Beauty back in December, and I’ve used this at least 2-3 days a week since. My hair has grown much faster than usual, and this oil makes my hair feel super soft! I’m even noticing that my edges are starting to fill out! I usually use about two droppers worth and massage it into my scalp and work it to the ends of my hair, once in the morning and once before i go to bed. It feels soothing to my scalp as well! One of my favorite hair products to use, and the results are even more amazing when i use it with the hair mask on wash day!", "title": "Amazing, works fast (for me 😌)!", "location_and_date": "Reviewed in the United States on January 27, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "From the second time using this one, even my children noticed the difference. My hair gets better 😍", "title": "I like it", "location_and_date": "Reviewed in the United States on January 27, 2024", "verified": true, "rating": "5.0"},
{"Link": "https://www.amazon.com/product-reviews/B07N7PK9QK/sortBy=recent/sortBy=recent/ref=cm_cr_arp_d_paging_btm_next_10?sortBy=recent&pageNumber=10"},
{"asin": "B07N7PK9QK", "text": "My hair is greasy so I wasn’t really expecting a lot from it but it made my hair really soft and looks so Healty now", "title": "This made my hair so soft", "location_and_date": "Reviewed in the United States on January 26, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Used 2 bottles ro see if it helps stop my hairfall.Doesnt work as expected", "title": "Not much difference on hair", "location_and_date": "Reviewed in the United States on January 26, 2024", "verified": true, "rating": "3.0"},
{"asin": "B07N7PK9QK", "text": "Works amazing!", "title": "Hair Oil", "location_and_date": "Reviewed in the United States on January 26, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Good product", "title": "Rev", "location_and_date": "Reviewed in the United States on January 26, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "This is the best hair oil, hands-down I feel like I’ve tried everything and nothing else compares to this oil. I’ve also felt like it does improve the likelihood of care growth, and it smells super good.", "title": "10/10", "location_and_date": "Reviewed in the United States on January 26, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "Mi pelo ha crecido impresionante desde que lo uso, ademas que me ha durado un montón y eso que lo uso cada 2 o 3 veces a la semana. Y por el precio vale toda la pena del mundo", "title": "Este producto es un esencial para el pelo", "location_and_date": "Reviewed in the United States on January 26, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "So the oil itself seems fine, and as described and seems to work well with my hair, BUT there is some seriously cheap material used for the cap (screw top) and When screwing it back on using barely any force, the black plastic cracked apart instantly. So now it cannot be closed with a seal. Not sure if this is the result of just really poor quality plastic being used for the top, rough handling in shipping, or a combination of both, but I’m kinda annoyed that it broke like this after the first time screwing the cap back on.", "title": "Screw-top plastic cracked/broke the first time I screwed it back on", "location_and_date": "Reviewed in the United States on January 26, 2024", "verified": true, "rating": "2.0"},
{"asin": "B07N7PK9QK", "text": "Not suitable on dry scalp", "title": "Crazy hairfall", "location_and_date": "Reviewed in the United States on January 26, 2024", "verified": true, "rating": "1.0"},
{"asin": "B07N7PK9QK", "text": "I love this hair oil, amazing product especially for the price", "title": "Works great, smells great", "location_and_date": "Reviewed in the United States on January 26, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "mi cabello se siente bien hidratado.", "title": "Me Encanta", "location_and_date": "Reviewed in the United States on January 26, 2024", "verified": true, "rating": "4.0"},
{"Link": "https://www.amazon.com/product-reviews/B07N7PK9QK/sortBy=recent/sortBy=recent/ref=cm_cr_arp_d_paging_btm_next_11?sortBy=recent&pageNumber=11"},
{"asin": "B07N7PK9QK", "text": "Works good", "title": "Like it", "location_and_date": "Reviewed in the United States on January 26, 2024", "verified": true, "rating": "4.0"},
{"asin": "B07N7PK9QK", "text": "Love the smell", "title": "It works but it takes time", "location_and_date": "Reviewed in the United States on January 25, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "I’m liking this oil, hair growing back", "title": "Best hair growth oil", "location_and_date": "Reviewed in the United States on January 25, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "My boyfriend and I both noticed pimples on our scalps and itching. I don’t see any major growth like others so I stopped using the product.", "title": "Pimples on scalp", "location_and_date": "Reviewed in the United States on January 25, 2024", "verified": true, "rating": "2.0"},
{"asin": "B07N7PK9QK", "text": "Sorry, I cant continue using it. It really smells so bad. At first, the minty fragrance is there but 2 hours later, it turns to something really smelly. And my hair tends to get too oily", "title": "Stinks", "location_and_date": "Reviewed in the United States on January 25, 2024", "verified": true, "rating": "1.0"},
{"asin": "B07N7PK9QK", "text": "Didn't do anything for my hair. I would not recommend using it on the scalp, especially for those with serious hair thinning issues. It also leaves a unpleasant greasy smell after a while of application.", "title": "Don't use on your scalp", "location_and_date": "Reviewed in the United States on January 25, 2024", "verified": true, "rating": "1.0"},
{"asin": "B07N7PK9QK", "text": "I'm not sure this oil did much for me. After several weeks of using it every other day, I did not notice any difference in hair thickness or a reduction in hair fall. It doesn't smell much like rosemary, the ingredient that is supposed to stimulate hair growth, so maybe its concentration in the oil was too low to be effective. At least I didn't experience any irritation, but I do not think it is worth buying again.", "title": "Not sure it had an effect, but no harm done", "location_and_date": "Reviewed in the United States on January 25, 2024", "verified": true, "rating": "3.0"},
{"asin": "B07N7PK9QK", "text": "I saw this product being advertised on TikTok and decided to take a chance on it and am extremely impressed with how well the oil has been helping my hair! I use the product on hair wash day and will let the product sit on my scalp and hair for hours and then wash it out. The smell is also a big plus! Definitely worth your time and money!", "title": "Hair Oil", "location_and_date": "Reviewed in the United States on January 25, 2024", "verified": true, "rating": "5.0"},
{"asin": "B07N7PK9QK", "text": "The only way I can tell I have this product on is the minty smell.", "title": "This product does make a noticeable improvement for me", "location_and_date": "Reviewed in the United States on January 25, 2024", "verified": true, "rating": "3.0"},
{"asin": "B07N7PK9QK", "text": "I’ve used this once. I am going to try it again, but VERY sparingly! It made my hair very greasy looking and I had to wash my hair again. My scalp has been itching terribly since I used it. I may be allergic to some ingredients. One more try, but not until the weekend!", "title": "Use very little!", "location_and_date": "Reviewed in the United States on January 25, 2024", "verified": true, "rating": "3.0"}
]